app/Models/LoginModel.php

SELECT *
FROM `contact_us`
 LIMIT 20, 20
---
    public function showContact($perPage = 20, $offset = 0)
    {
       $builder= $this->db->table('contact_us');
        $builder->limit($perPage, $offset);

        $query = $builder->get();

SELECT COUNT(*) as total
FROM `contact_us`
---
    public function getPager($perPage = 20, $currentPage = 1)
    {
        $builder = $this->db->table('contact_us');
        $builder->select('COUNT(*) as total');

        $totalQuery = $builder->get();

SELECT *
FROM `categories`
---
    public function getCatData()
    {
        return $this->db->table('categories')
            ->get()
            ->getResultArray();

SELECT *
FROM `slider`
---
    public function getSlider()
    {
        return $this->db->table('slider')
            ->get()
            ->getResultArray();

SELECT `projects`.*, GROUP_CONCAT(images.image) as images
FROM `projects`
LEFT JOIN `images` ON `images`.`idProject` = `projects`.`id`
GROUP BY `projects`.`id`
---
    public function getCombinedData()
    {
        return $this->db->table('projects')
            ->select('projects.*, GROUP_CONCAT(images.image) as images')
            ->join('images', 'images.idProject = projects.id', 'left')
            ->groupBy('projects.id')
            ->get()
            ->getResultArray();

DELETE FROM `projects`
WHERE `id` = '28'
---
    public function delProject($id)
    {
        return $this->db->table('projects')->where('id', $id)->delete();

DELETE FROM `images`
WHERE `idProject` = '28'
---
    public function deleteImagesByProjectId($projectId)
    {
        // Assuming you have a table for images related to projects
        // Adjust the query according to your database structure
        $this->db->table('images') // Change to your images table
            ->where('idProject', $projectId)
            ->delete();

INSERT INTO `projects` (`idCategory`, `projectTitle`, `projectDescription`) VALUES ('62', 'Mobile App', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum')
---
    public function insertProject($data)
    {
        $this->db->table('projects')->insert($data);

INSERT INTO `images` (`idProject`, `image`) VALUES (31, '1728108402_31edc3239dd3135e31db.jpg')
---
    public function insertImage($data)
    {
        $this->db->table('images')->insert($data);

INSERT INTO `user_review` (`user`, `review`) VALUES ('Aamir', 'ndjsd')
---
    public function review($review)
    {
        return $this->db->table('user_review')->insert($review);

SELECT *
FROM `user_review`
 LIMIT 20, 20
---
    public function getReview($perPage =20, $offset=0)
    {
        $builder = $this->db->table('user_review');
        $builder->limit($perPage, $offset);
        $query=$builder->get();

SELECT *
FROM `blogs`
---
    public function getBlog()
    {
        return $this->db->table('blogs')->get()->getResultArray();