app/Models/LoginModel.php

    public function getCatData()
    {
        return $this->db->table('categories')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `categories`

    public function getSlider()
    {
        return $this->db->table('slider')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `slider`

    public function getProjectsByCategory($categoryId)
    {
        return $this->db->table('projects')
            ->select('projects.*, GROUP_CONCAT(images.image) as images')
            ->join('images', 'images.idProject = projects.id', 'left')
            ->where('projects.idCategory', $categoryId) // Filter by category
            ->groupBy('projects.id')
            ->get()
            ->getResultArray();
---
SELECT `projects`.*, GROUP_CONCAT(images.image) as images
FROM `projects`
LEFT JOIN `images` ON `images`.`idProject` = `projects`.`id`
WHERE `projects`.`idCategory` = '60'
GROUP BY `projects`.`id`

    public function getCombinedData()
    {
        return $this->db->table('projects')
            ->select('projects.*, GROUP_CONCAT(images.image) as images')
            ->join('images', 'images.idProject = projects.id', 'left')
            ->groupBy('projects.id')
            ->get()
            ->getResultArray();
---
SELECT `projects`.*, GROUP_CONCAT(images.image) as images
FROM `projects`
LEFT JOIN `images` ON `images`.`idProject` = `projects`.`id`
GROUP BY `projects`.`id`

    public function getReview()
    {
        return $this->db->table('user_review')->get()->getResultArray();
---
SELECT *
FROM `user_review`

    public function getBlog()
    {
        return $this->db->table('blogs')->get()->getResultArray();
---
SELECT *
FROM `blogs`

    public function bldetails($id)
    {
       return $this->db->table('blogs')
            ->where('id', $id)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `blogs`
WHERE `id` = '14'